RECORD_07-07-21_12.53.20_PM-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: RECORD 07-07-21 12.53.20 PM-Selenium
  blazegrid: true
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: RECORD 07-07-21 12.53.20 PM-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  RECORD 07-07-21 12.53.20 PM-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1920,969)
      - go(http://localhost:5000/Home/Search?cat=DigitalMarketing)
      - clickByName(email)
      - typeByName(email): "Mayuri00gohil@gmail.com"
      - clickByName(password)
      - typeByName(password): "Mayuri@123"
      - clickByCSS(button.fluid.ui.teal.button)

  RECORD 07-07-21 12.53.20 PM-Http:
    headers:
      sec-ch-ua: '" Not;A Brand";v="99", "Google Chrome";v="91", "Chromium";v="91"'
      sec-ch-ua-mobile: '?0'
      User-Agent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/91.0.4472.114 Safari/537.36'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'http://localhost:60968/authentication/authentication/signin'
            method: POST
            label: 'http://localhost:60968/authentication/authentication/signin'
            headers:
              Accept: 'application/json, text/javascript, */*; q=0.01'
              Content-Type: application/json
            body: '{"rememberMe":false,"email":"Mayuri00gohil@gmail.com","password":"Mayuri@123"}'
          - url: 'http://localhost:60190/profile/profile/isUserAuthenticated'
            method: GET
            label: 'http://localhost:60190/profile/profile/isUserAuthenticated'
            headers:
              Accept: 'application/json, text/javascript, */*; q=0.01'
              Authorization: Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ1c2VySWQiOiI2MDYyZTMwY2JkM2JhYTAwMDE4OGY1YjAiLCJpc3MiOiJodHRwOi8vbG9jYWxob3N0OjYwOTY4IiwiaWF0IjoxNjI1NjE5MjE0LCJleHAiOjE2MjU2MjI4MTQsInVuaXF1ZV9uYW1lIjoiNjA2MmUzMGNiZDNiYWEwMDAxODhmNWIwIn0.W5jZwyNz_iPtIFUqYiDJxJlB2-oQAAuk-ffoWajsaes
              Content-Type: application/json
          - url: 'http://localhost:60190/notification/notification/getNotification'
            method: GET
            label: 'http://localhost:60190/notification/notification/getNotification'
            headers:
              Accept: '*/*'
              Authorization: Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ1c2VySWQiOiI2MDYyZTMwY2JkM2JhYTAwMDE4OGY1YjAiLCJpc3MiOiJodHRwOi8vbG9jYWxob3N0OjYwOTY4IiwiaWF0IjoxNjI1NjE5MjE0LCJleHAiOjE2MjU2MjI4MTQsInVuaXF1ZV9uYW1lIjoiNjA2MmUzMGNiZDNiYWEwMDAxODhmNWIwIn0.W5jZwyNz_iPtIFUqYiDJxJlB2-oQAAuk-ffoWajsaes
              Content-Type: application/json; charset=utf-8
            body:
              numberOfNotifications: '5'
          - url: 'http://localhost:60190/notification/notification/getNewNotificationCount'
            method: GET
            label: 'http://localhost:60190/notification/notification/getNewNotificationCount'
            headers:
              Accept: '*/*'
              Authorization: Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ1c2VySWQiOiI2MDYyZTMwY2JkM2JhYTAwMDE4OGY1YjAiLCJpc3MiOiJodHRwOi8vbG9jYWxob3N0OjYwOTY4IiwiaWF0IjoxNjI1NjE5MjE0LCJleHAiOjE2MjU2MjI4MTQsInVuaXF1ZV9uYW1lIjoiNjA2MmUzMGNiZDNiYWEwMDAxODhmNWIwIn0.W5jZwyNz_iPtIFUqYiDJxJlB2-oQAAuk-ffoWajsaes
              Content-Type: application/json; charset=utf-8
          - url: 'http://localhost:51689/listing/listing/getBalance'
            method: GET
            label: 'http://localhost:51689/listing/listing/getBalance'
            headers:
              Accept: '*/*'
              Authorization: Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ1c2VySWQiOiI2MDYyZTMwY2JkM2JhYTAwMDE4OGY1YjAiLCJpc3MiOiJodHRwOi8vbG9jYWxob3N0OjYwOTY4IiwiaWF0IjoxNjI1NjE5MjE0LCJleHAiOjE2MjU2MjI4MTQsInVuaXF1ZV9uYW1lIjoiNjA2MmUzMGNiZDNiYWEwMDAxODhmNWIwIn0.W5jZwyNz_iPtIFUqYiDJxJlB2-oQAAuk-ffoWajsaes
              Content-Type: application/json; charset=utf-8